Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: If Obj is a class prototype object, the getter should not (and in some cases cannot) be called; so the property is skipped.
ja: Objがクラスプロトタイプオブジェクトの場合、ゲッターは呼ばれるべきでなく（場合によっては呼べない）、そのためプロパティはスキップされます。

source: If Obj itself does not define a getter for this property, it is skipped.
ja: Obj自身がこのプロパティのゲッターを定義していない場合、スキップされます。

source: If Occurrence is negative, the search is always conducted from right to left.
ja: Occurrenceが負の場合、検索は常に右から左へ行われます。

source: If Occurrence is omitted, a negative StartingPos causes the search to be conducted from right to left.
ja: Occurrenceを省略したときは、StartingPosが負であれば、右から左へ検索します。

source: If Occurrence is omitted, it defaults to the first match of Needle in Haystack.
ja: Occurrenceが省略された場合、NeedleinHaystackの最初のマッチにデフォルトで設定されます。

source: If Occurrence is positive, the search is always conducted from left to right.
ja: Occurrenceが正の場合、検索は常に左から右へ行われる。

source: If Param2 is "Class" or "CLSID", type information is retrieved via the IProvideClassInfo::GetClassInfo interface method.
ja: Param2が"Class"または"CLSID"の場合、型情報はIProvideClassInfo::GetClassInfoインタフェースメソッドにより取得されます。

source: If Param2 is "Name" or "IID", type information is retrieved via the IDispatch::GetTypeInfo interface method.
ja: Param2が"Name"または"IID"の場合、IDispatch::GetTypeInfoインタフェースメソッドにより型情報を取得します。

source: If ParamIndex is invalid, an exception is thrown.
ja: ParamIndexが無効な場合は、例外が発生します。

source: If Path contains a filename that lacks a drive letter (that is, it has no path or merely a relative path), OutDrive will be made blank but all the other output variables will be set correctly.
ja: Pathにドライブ文字がないファイル名（つまり、パスがないか、単に相対パス）が含まれている場合、OutDriveは空白になるが、他のすべての出力変数は正しく設定される。

source: If Period is 0, the timer is marked for deletion.
ja: Periodが0の場合、タイマーは削除の対象となります。

source: If Period is greater than 0, the timer will automatically repeat until it is explicitly disabled by the script.
ja: Periodが0より大きい場合、スクリプトによって明示的に無効にされるまで、タイマーは自動的に繰り返されます。

source: If Period is less than 0, the timer will run only once.
ja: Periodが0より小さい場合、タイマーは1回だけ実行されます。

source: If PrefixOrSink is an object, whenever an event is raised, the corresponding method of that object is called.
ja: PrefixOrSinkがオブジェクトの場合、イベントが発生するたびに、そのオブジェクトの対応するメソッドが呼び出されます。

source: If Prompt is long, it can be broken up into several shorter lines by means of a continuation section, which might improve readability and maintainability.
ja: Promptが長い場合、継続セクションによっていくつかの短い行に分割することができ、読みやすさや保守性を向上させることができます。

source: If Replacement is a function, it is called with one parameter, the name of the hotstring.
ja: 置換が関数の場合、1つのパラメータ（ホットストリングの名前）で呼び出されます。

source: If ReturnType is HRESULT (or omitted) and the method returned an error value (as defined by the FAILED macro), an OSError is thrown.
ja: ReturnTypeがHRESULT（または省略）で、メソッドがエラー値を返した場合（FAILED マクロで定義）、OSErrorがスローされます。

source: If RowNumber is 0, all rows in the control are modified (in this case the return value is 1 on complete success and 0 if any part of the operation failed).
ja: RowNumberが 0 の場合、コントロール内のすべての行が変更される（この場合、戻り値は完全な成功で 1、操作の一部が失敗した場合は 0 となる）。

source: If StartingPos is 0 or beyond String's length, an empty string is returned.
ja: StartingPosが0またはStringの長さを超えている場合、空の文字列が返される。

source: If StartingPos is omitted, it defaults to 1 (the beginning of Haystack).
ja: StartingPosが省略された場合、デフォルトは 1（Haystackの先頭）です。

source: If SubMenu1 itself contains a menu, this is the name of the menu item inside, or its position.
ja: SubMenu1自身にメニューがある場合は、その中のメニューの名前、またはその位置を示します。

source: If Target cannot be launched, an exception is thrown (that is, an error window is displayed) and the current thread is exited, unless the error is caught by a Try/Catch statement.
ja: Targetを起動できない場合、Try/Catch文によってエラーが捕捉されない限り、例外が発生し（つまり、エラーウィンドウが表示され）、現在のスレッドが終了する。

source: If Target is an object, specifying a Length that exceeds the buffer size calculated from Target.Size is considered an error, even if the converted string would fit within the buffer.
ja: Targetがオブジェクトの場合、Target.Sizeから計算されるバッファサイズを超えるLengthを指定すると、変換後の文字列がバッファ内に収まる場合でもエラーとみなされます。

source: If Target is omitted, this function returns the required buffer size in bytes, including space for the null-terminator.
ja: Targetが省略された場合、この関数はヌル・ターミネータ用のスペースを含む、必要なバッファ・サイズをバイト単位で返す。

source: If Target is specified, this function returns the number of bytes written.
ja: Targetが指定された場合、この関数は書き込まれたバイト数を返す。

source: If Text is blank, Filename will be created as an empty file (but if the file already exists, its modification time will be updated).
ja: Textが空白の場合、Filenameは空のファイルとして作成されます（ただし、ファイルがすでに存在する場合は、その修正時刻が更新されます）。

source: If Text is long, it can be broken up into several shorter lines by means of a continuation section, which might improve readability and maintainability.
ja: Textが長い場合、継続セクションによっていくつかの短い行に分割することができ、読みやすさと保守性を向上させることができるかもしれません。

source: If Text is omitted or blank, the return value is an empty string.
ja: Textが省略されたか空白の場合、戻り値は空文字列となる。

source: If Title is blank, the title line will be entirely omitted from the window, making it vertically shorter.
ja: Titleが空白の場合、タイトル行はウィンドウから完全に省略され、縦に短くなる。

source: If Try is used without Catch or Finally, it is equivalent to having catch Error with an empty block.
ja: Catchや Finallyを使わずにTryを使うと、空のブロックでcatch Errorを実行するのと同じことになります。

source: If Try is used without Finally or Catch, it acts as though it has a Catch with an empty block.
ja: Tryが Finallyや Catchなしで使われた場合、空のブロックでCatchがあるかのように動作します。

source: If Value2 is less than 0 or greater than 63, an exception is thrown.
ja: Value2が0より小さいか63より大きい場合、例外がスローされる。

source: If Value is a negative integer, it is treated the same as the corresponding numeric string.
ja: Valueが負の整数の場合、対応する数値文字列と同じように扱われます。

source: If Value is a number, the default decimal formatting is used.
ja: Valueが数値の場合、デフォルトの10進数書式が使用されます。

source: If Value is a string (even a numeric string), the entry whose leading part matches Value will be selected.
ja: Valueが文字列（数値文字列でも可）の場合、先頭部分がValueと一致するエントリーが選択されます。

source: If Value is a variable reference such as MyVar (and not a built-in variable), the return value is the memory address of the variable's internal string buffer.
ja: Valueが MyVarのような変数参照（組み込み変数ではない）の場合、戻り値はその変数の内部文字列バッファのメモリアドレスとなる。

source: If Value is an Object and owns a value property named Message, its value is used as the message.
ja: Valueが Objectで、Messageという名前のvalueプロパティを持つ場合、その値がメッセージとして使われる。

source: If Value is an object, the return value is the result of calling Value.ToString().
ja: Valueがオブジェクトの場合は、Value.ToString() を呼び出した結果が返り値となります。

source: If Value is not an integer, the tab whose leading part matches Value will be used.
ja: Valueが整数でない場合、先頭部分がValueと一致するタブが使用されます。

source: If Value is omitted, the item will be made 0 or blank depending on its type.
ja: Valueが省略された場合、項目の種類に応じて 0 または空白とします。

source: If Value is zero or empty, the current selection is removed.
ja: Valueが0または空の場合、現在の選択項目は削除されます。

source: If ValueType is REG_DWORD, Value should be between -2147483648 and 4294967295 (0xFFFFFFFF).
ja: ValueTypeがREG_DWORDの場合、Valueは-2147483648から4294967295（0xFFFFFFF）の間とする。

source: If VersionB begins with an operator symbol, this function returns 1 (true) or 0 (false).
ja: VersionBが演算子記号で始まる場合、この関数は 1（真）または 0（偽）を返す。

source: If Width and Height are small (or negative), most windows with a title bar will generally go no smaller than 112 x 27 pixels (however, some types of windows may have a different minimum size).
ja: Widthと Heightが小さい（または負）場合、タイトルバーを持つほとんどのウィンドウは通常112 x 27ピクセル以下になります（ただし、ウィンドウの種類によっては最小サイズが異なる場合があります）。

source: If WinTitle is "Program Manager", the function will retrieve the size of the desktop, which is usually the same as the current screen resolution.
ja: WinTitleが"Program Manager" のときは、この関数はデスクトップのサイズを取得します。通常、これは現在の画面解像度と同じです。

source: If WinTitle is the letter "A" and the other parameters are omitted, the active window is restored.
ja: WinTitleが文字「A」で、他のパラメータが省略された場合、アクティブなウィンドウが復元される。

source: If WinTitle specifies a pure HWND (as an Integer or an Object with a HWND property), hidden windows are detected only when using DetectHiddenWindows.
ja: WinTitleがピュアHWND（IntegerまたはHWNDプロパティを持つObjectとして）を指定した場合、隠しウィンドウはDetectHiddenWindowsを使用したときのみ検出されます。

source: If WinTitle specifies an invalid HWND (either as an Integer or via the Hwnd property of an object), the function returns immediately, without waiting for Timeout to expire.
ja: WinTitleが無効なHWNDを指定した場合（整数として、またはオブジェクトのHwndプロパティを通して）、関数はタイムアウトの時間切れを待たずに即座に戻ります。

source: If WinTitle specifies an invalid pure HWND, the function returns immediately, without waiting for Timeout to expire.
ja: WinTitleが無効なピュアHWNDを指定した場合、関数はTimeoutの時間切れを待たずに即座に戻ります。

source: If YYYYMMDDHH24MISS contains a invalid date and/or time portion -- such as February 29th of a non-leap year -- the date and/or time will be omitted from the return value.
ja: YYYYMMDDHH24MISSに無効な日付・時刻部分（うるう年の2月29日など）が含まれる場合、その日付・時刻は戻り値から除外されます。

source: If var is type
ja: varが 型である場合

source: If var is type ignores the system locale by default
ja: varがtypeの場合、デフォルトでシステムロケールを無視します。

source: If width is prefixed by 0, leading zeros are added until the minimum width is reached.
ja: widthの前に0を付けると、最小幅に達するまで先頭の0が追加されます。

source: If Bytes is omitted, it defaults to the size of the buffer.
ja: Bytesが省略された場合、デフォルトでバッファのサイズになります。

source: If ColumnNumber is larger than the number of columns currently in the control, the new column is added next to the last column on the right side.
ja: ColumnNumberが現在コントロール内にある列の数より大きい場合、新しい列は右側の最後の列の隣に追加されます。

source: If DateTime1 is earlier than DateTime2, a negative number is returned.
ja: DateTime1 がDateTime2より早いときは、負の数を返します。

source: If EnvVar has an empty value or does not exist, an empty string is returned.
ja: EnvVarが空または存在しないときは、空の文字列が返されます。

source: If FileName is unset or omitted, IconNumber is ignored.
ja: FileNameが設定されていないか省略されている場合、IconNumberは無視されます。

source: If FilePattern is a single folder rather than a wildcard pattern, it will always be operated upon regardless of this setting.
ja: FilePatternがワイルドカードパターンではなく、単一のフォルダの場合、この設定に関係なく常に操作されます。

source: If Function is of a type that does not return a value, the result is an undefined value of the specified return type (integer by default).
ja: Functionが値を返さない型の場合、結果は指定された戻り値の型（デフォルトでは整数）の未定義値です。

source: If IconNumber is negative, its absolute value is assumed to be the resource ID of an icon within an executable file.
ja: IconNumberが負の場合、その絶対値は実行ファイル内のアイコンのリソース ID とみなされます。

source: If Index is omitted, Format must still be preceded by :.
ja: Indexが省略された場合でも、Formatの前には:が必要です。

source: If Length is negative, its absolute value indicates the exact number of characters to convert, including any binary zeros that the string might contain -- in other words, the result is always a string of exactly that length.
ja: Lengthが負の場合、その絶対値は、文字列が含むかもしれない2進数のゼロを含む、変換する正確な文字数を示します--言い換えれば、結果は常に正確にその長さの文字列になります。

source: If NumberOfVars is 2, the enumerator is expected to assign the key or index of an item to the first parameter and the value to the second parameter.
ja: NumberOfVarsが2の場合、列挙者は項目のキーまたはインデックスを最初のパラメータに、値を2番目のパラメータに代入することが期待される。

source: If OutputFile was specified, the special mode of FileAppend described above may also be used within the Else statement's body.
ja: OutputFileが指定された場合、Else文の本体内では、上記の FileAppendの特殊モードも使用することができます。

source: If Path is invalid (e.g. because the drive does not exist), the return value is an empty string.
ja: Pathが無効だったときは、（例えば、ドライブが存在しない場合）、戻り値は空文字列となります。

source: If RowNumber is greater than the number of rows in the list (even as high as 2147483647), the new row is added to the end of the list.
ja: RowNumberがリストの行数より大きい場合（2147483647でも）、新しい行はリストの末尾に追加されます。

source: If StartingPos is beyond the length of Haystack, the search starts at the empty string that lies at the end of Haystack (which typically results in no match).
ja: StartingPosが Haystackの長さを超えている場合、Haystackの末尾にある空の文字列から検索を開始します（通常、一致しない結果になります）。

source: If StartingPos is beyond the length of Haystack, the search starts at the empty string that lies at the end of Haystack (which typically results in no replacements).
ja: StartingPosが Haystackの長さを超えている場合、Haystackの末尾にある空の文字列から検索を開始します（通常、置換されない結果になります）。

source: If StartingPos tries to go beyond the left end of Haystack, all of Haystack is searched.
ja: StartingPosが Haystackの左端を越えようとした場合、Haystackの全てが検索される。

source: If StartingPos tries to go beyond the left end of the string, the extraction starts at the first character.
ja: StartingPosが文字列の左端を超えようとすると、抽出は最初の文字から始まる。

source: If Target is a local file and no path was specified with it, A_WorkingDir will be searched first.
ja: Targetがローカルファイルでパスが指定されていない場合、A_WorkingDirが最初に検索されます。

source: If Default is given a value, even "", no exception is thrown.
ja: Defaultに値が与えられた場合、""でも例外は発生しない。

source: If FontName is omitted or does not exist on the system, the previous font's typeface will be used (or if none, the system's default GUI typeface).
ja: FontNameが省略された場合、またはシステム上に存在しない場合は、以前のフォントの書体が使用されます（存在しない場合は、システムのデフォルトのGUI書体が使用されます）。

source: If Get or Set is not defined, it can be inherited from a base object.
ja: GetまたはSetが定義されていない場合は、ベース・オブジェクトから継承することができる。

source: If Length is positive, the converted string ends at the first binary zero as in v1.
ja: Lengthが正の場合、変換後の文字列はv1のように最初の2進数ゼロで終了します。

source: If String begins with a Unicode supplementary character, this function returns the corresponding Unicode character code (a number between 0x10000 and 0x10FFFF).
ja: StringがUnicode補助文字で始まるときは、対応するUnicode文字コード（0x10000から0x10FFFFの間の数値）を返します。

source: If Text is not an object, the data size is always a multiple of 2 bytes due to the use of UTF-16 strings.
ja: Textがオブジェクトでない場合、UTF-16文字列を使用するため、データサイズは常に2バイトの倍数となる。

source: If Value is zero, a blank string or omitted, subsequently controls are added outside the Tab control.
ja: Valueが 0、空文字列、または省略された場合、Tab コントロールの外側にコントロールが追加されます。

source: If Width and Height are large, most windows will go no larger than approximately 12 pixels beyond the dimensions of the desktop.
ja: Widthと Heightが大きい場合、ほとんどのウィンドウはデスクトップの寸法から約12ピクセル以上大きくなりません。

source: If pcre_callout is not defined, RegEx callouts which omit Function are ignored.
ja: pcre_calloutが定義されていない場合、Functionを省略したRegExコールアウトは無視される。

source: If Value is a non-numeric string, it is used as the message.
ja: Valueが数値以外の文字列の場合、それがメッセージとして使われる。

source: If w-h is omitted, 30-30 is used.
ja: w-hが省略された場合は、30-30が使用される。

source: If Exponent is negative, the result will be formatted as a floating point number even if Base and Exponent are both integers.
ja: 指数が負の場合、基数と 指数がともに整数であっても、結果は浮動小数点数としてフォーマットされる。

source: If Get is undefined, the property can return a value inherited from a base.
ja: Getが未定義の場合、プロパティはベースから継承した値を返すことができます。

source: If Value is numeric, it is shown below the default message.
ja: Valueが数値の場合、デフォルトメッセージの下に表示される。

source: If exponent is negative, the result will be formatted as a floating point number even if base and exponent are both integers.
ja: 指数が負の場合、基数と 指数がともに整数であっても、結果は浮動小数点数としてフォーマットされる。

source: If Set is undefined in this and all base objects (or is obscured by an inherited value property), attempting to set the property causes an exception to be thrown.
ja: Setがこのオブジェクトとすべてのベースオブジェクトで未定義である場合（または継承された値プロパティによって隠されている場合）、プロパティを設定しようとすると例外がスローされます。

source: If n is greater than the length of any string, that string is considered to be blank for the purpose of the sort.
ja: nが文字列の長さより大きい場合、その文字列はソートの目的のために空白であるとみなされる。

source: If Code is omitted, it defaults to A_LastError.
ja: Codeが省略された場合、デフォルトはA_LastErrorとなります。

source: If Function is specified but is not the name of a function object, a compile error occurs and pattern-matching does not begin.
ja: Functionが指定されているが関数オブジェクトの名前でない場合、コンパイル・エラーが発生し、パターンマッチングは開始されない。

source: If Length is also specified, it must not exceed Size (multiplied by 2 for UTF-16).
ja: Lengthも指定された場合は、Size（UTF-16の場合は2倍）を超えてはいけません。

source: If code is omitted it defaults to A_LastError.
ja: codeが省略された場合、デフォルトはA_LastErrorとなります。

source: If Flags is numeric, the absence of sharing mode flags causes the file to be locked.
ja: Flagsが数値の場合、共有モードフラグがない場合は、ファイルがロックされます。

source: If Mask is omitted, NewFlags specifies the flags to add (if positive) or remove (if negative).
ja: Maskが省略された場合、NewFlagsは、追加するフラグ（正の場合）または削除するフラグ（負の場合）を指定します。

source: If Target begins with a quotation mark, everything up to the next quotation mark is considered the action, typically an executable file.
ja: Targetが引用符で始まる場合、次の引用符までのすべてがアクションとみなされ、通常は実行可能なファイルです。

source: If n is omitted, it defaults to 1.
ja: nが省略された場合、デフォルトは 1 です。

source: If NumLock is OFF but Shift is pressed, the system temporarily releases Shift and acts as though NumLock is ON.
ja: NumLockがOFFの状態でShiftを押すと、一時的にShiftが解除され、NumLockがONであるかのように動作します。

source: If MPRESS.exe and/or UPX.exe has been copied to the "Compiler" subfolder where AutoHotkey was installed, either can be used to compress the .exe as directed by the /compress parameter or the GUI setting.
ja: MPRESS.exeおよび/またはUPX.exeがAutoHotkeyがインストールされた「Compiler」サブフォルダにコピーされている場合、/compressパラメータまたはGUI設定の指示に従い、どちらかを使用して.exeを圧縮することができます。

source: If false, any requirement previously set by this function is removed, potentially uninstalling the hook.
ja: falseのときは、この関数によって以前に設定された要件はすべて削除され、フックがアンインストールされる可能性があります。

source: If false, files and subdirectories contained in DirName are not removed.
ja: falseの場合、DirName に含まれるファイルとサブフォルダは削除されません。

source: If false, hidden text is not detected.
ja: falseのときは、不可視テキストを検出しません。

source: If false, hidden windows are not detected, except by the WinShow function.
ja: falseのときは、WinShow関数を除いて非表示ウィンドウを検知しません。

source: If false, the default behaviour is restored.
ja: false のときは、デフォルトの動作に戻ります。

source: If false, the icon is unfrozen.
ja: falseの場合、アイコンは凍結されない。

source: If false, the state of CapsLock is not changed at all.
ja: falseの場合、CapsLockの状態は全く変わりません。

source: If true, CapsLock will be restored to its former value if Send needed to change it temporarily for its operation.
ja: true の場合、Send関数が操作のためにCapsLockの状態を一時的に変更しても元の状態に戻ります。

source: If true, all files and subdirectories are removed (like the Windows command "rmdir /S").
ja: trueの場合、Windowsの「rmdir /S」コマンドのようにファイルとサブフォルダは削除されます。

source: If true, hidden text is detected.
ja: trueのときは、不可視テキストを検出します。

source: If true, hidden windows are detected.
ja: trueのときは非表示ウィンドウを検知します。

source: If true, the hook is required to be installed.
ja: trueのときは、フックのインストールが必要です。

source: If true, the script will be kept running after all threads have exited, even if none of the other conditions for keeping the script running are met.
ja: true のときは、すべてのスレッドが終了した後も スクリプトを実行し続けるための他の条件が満たされていなくても、 スクリプトを実行し続けます。

source: If A_Index is greater than 100, return.
ja: A_Indexが 100 より大きい場合、リターンします。

source: If Color is the word "Blue" or "White":
ja: Colorが「Blue」または「White」という単語である場合：

source: If Coords is specified, ClickCount must appear after it.
ja: Coordsが指定されている場合は、ClickCountはその後に表示されなければならない。

source: If Ahk2Exe is installed, this opens the Ahk2Exe Gui with the current script pre-selected.
ja: Ahk2Exeがインストール済のときは、現在のスクリプトがあらかじめ選択された状態でAhk2Exe Guiが開かれます。

source: If AutoHotkey and the target window are both 64-bit, any integer value supported by AutoHotkey can be used.
ja: AutoHotkeyとターゲットウィンドウの両方が64ビットである場合、AutoHotkeyがサポートする任意の整数値を使用することができます。

source: If AutoHotkey cannot be installed the normal way, see How to Install AutoHotkey for more help.
ja: AutoHotkeyを通常の方法でインストールできないときは、AutoHotkeyのインストール方法をご覧ください。

source: If AutoHotkey is not installed, the value is blank.
ja: AutoHotkeyがインストールされていない場合、値は空白になります。

source: If AutoHotkey is pinned to the taskbar or Start menu on Windows 7 or later, recent or pinned scripts can be launched via the program's Jump List.
ja: Windows 7以降でAutoHotkeyがタスクバーまたはスタートメニューにピン留めされている場合、プログラムのジャンプリストから最近のスクリプトまたはピン留めされたスクリプトを起動できます。

source: If AutoHotkey or the target window is 32-bit, only the parameter's low 32 bits are used; that is, values are truncated if outside the range -2147483648 to 2147483647 (-0x80000000 to 0x7FFFFFFF) for signed values, or 0 to 4294967295 (0xFFFFFFFF) for unsigned values.
ja: AutoHotkeyまたはターゲットウィンドウが32ビットの場合、パラメータの下位32ビットのみが使用されます。つまり、符号付き値の場合は-2147483648～2147483647（-0x80000000～0x7FFFFFFF）、符号なし値の場合は0～4294967295（0xFFFFFF）範囲外の場合は値が切り捨てられます。

source: If BlockInput becomes active while the user is holding down keys, it might cause those keys to become "stuck down".
ja: ユーザーがキーを押しているときにBlockInputがアクティブになると、そのキーが「stuck down」になってしまうことがあります。

source: If CP0 is the current setting, A_FileEncoding returns CP0 (never a blank value).
ja: CP0が現在の設定である場合、A_FileEncodingは、CP0を返す（決して空白値ではない）。

source: If CapsLock is on when you press the hotkey.
ja: ホットキーを押したときにCapsLockがオンになっている場合。

source: If ClipWait times out, an error message is shown, otherwise the clipboard contents is shown.
ja: ClipWaitがタイムアウトした場合はエラーメッセージを表示し、それ以外の場合はクリップボードの内容を表示します。

source: If CoordMode is not used, the default mode is Client; that is, all built-in functions except those documented otherwise (e.g. WinMove and InputBox) use coordinates that are relative to the active window's client area.
ja: CoordMode関数を使用しない場合、既定のモードはClientです。つまり、特に文書化されていない関数（WinMove や InputBox など）を除くすべての組み込み関数は、アクティブ ウィンドウのクライアント領域を基準にした座標を使用します。

source: If Critical is not used by the auto-execute thread, all threads start off as noncritical (though the settings of Thread Interrupt will still apply).
ja: 自動実行スレッドでCriticalが使用されない場合、すべてのスレッドはノンクリティカルとしてスタートします（ただし、Thread Interruptの設定はそのまま適用されます）。

source: If Critical is not used by the auto-execute thread, all threads start off as noncritical (though the settings of Thread "Interrupt" will still apply).
ja: 自動実行スレッドでCriticalが使用されない場合、すべてのスレッドはノンクリティカルとしてスタートします（ただし、Thread "Interrupt "の設定はそのまま適用されます）。

source: If DPI scaling is enabled, coordinates and sizes passed to or retrieved from the Gui and GuiControl methods/properties are automatically scaled based on screen DPI.
ja: DPIスケーリングが有効な場合、GuiおよびGuiControlのメソッド/プロパティに渡されたり、そこから取得された座標やサイズは、画面のDPIに基づいて自動的にスケーリングされます。

source: If DetectHiddenText is not used, the default setting is 1 (true).
ja: DetectHiddenText関数を使わなかったときは、初期値は1 (true)です。

source: If DetectHiddenWindows is not used, the default setting is 0 (false).
ja: DetectHiddenWindows関数が使われないときは、初期値は0 (false)です。

source: If DllCall's first parameter is a literal string such as "MulDiv" and the DLL containing the function is ordinarily loaded before the script starts, or has been successfully loaded with #DllLoad, the string is automatically resolved to a function address.
ja: DllCallの第1パラメータが"MulDiv"などのリテラル文字列で、その関数を含むDLLがスクリプトの開始前に通常ロードされているか、#DllLoadで正常にロードされていれば、文字列は自動的に関数アドレスに解決されます。

source: If FileEncoding is not used, the default encoding is CP0.
ja: FileEncodingが使われていないときは、エンコードの初期値はCP0です。

source: If Input is still in progress after MaxTime seconds, the method returns and does not terminate Input.
ja: MaxTime秒後に Input がまだ進行している場合、このメソッドは戻り、Input は終了しません。

source: If Input is still in progress when the timeout period elapses, it is terminated and EndReason is set to the word Timeout.
ja: タイムアウト時間が経過しても入力が継続している場合は、入力は終了し、EndReasonに Timeout という単語が設定されます。

source: If KeyHistory is not used, the default setting is 40.
ja: KeyHistory関数が使われないときは、初期値は40です。

source: If ListLines is not used to affect line logging, the default setting is 1 (true).
ja: ListLinesを使用してログをとるのに影響を与えないときは、デフォルト設定は 1 (true) です。

source: If ListVars is used inside a function, the following are listed:
ja: ListVarsを関数内で使用した場合、以下のようになります：
